pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_RST_2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_RST_2_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_RST_2_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_RST_2_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_RST_2_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_25 (coord P9), PCIe1_PERST#
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_RST_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_RST_1_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_RST_1_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_RST_1_PIN 25U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_RST_1_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO3_13 (coord H4), PCIe2_Power_swichting_3V3Aux
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_AUX_2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_AUX_2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_AUX_2_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_AUX_2_PIN 13U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_AUX_2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO2_7 (coord J2), PCIe1_Power_switching_3V3
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_3V3_1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_3V3_1_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_3V3_1_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_3V3_1_PIN 7U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_3V3_1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO1_20 (coord M1), SUPP_1_Power_switching
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_12V_3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_3_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_12V_3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_3_PIN 20U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_12V_3_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_6 (coord G4), PCIe2_Power_switching_12V
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_12V_2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_12V_2_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_2_PIN 6U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_12V_2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO3_17 (coord K1), PCIe2_Power_switching_3V3
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_3V3_2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_3V3_2_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_3V3_2_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_3V3_2_PIN 17U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_3V3_2_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO4_4 (coord D9), PCIe1_Power_switching_12V
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_12V_1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_1_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_12V_1_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_1_PIN 4U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_12V_1_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO3_26 (coord K5), PCIe1_Power_switching_3V3Aux
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_AUX_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_AUX_1_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_AUX_1_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_AUX_1_PIN 26U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_AUX_1_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO2_8 (coord F4), SUPP_2_Power_switching
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PS_12V_4_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_4_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PS_12V_4_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PS_12V_4_PIN 8U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PS_12V_4_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO1_1 (coord K12), PCIe2_Plug_in_sensing
  @{ */

