pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PIS_2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PIS_2_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PIS_2_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PIS_2_PIN 1U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PIS_2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_1 (coord K12), PCIe2_Plug_in_sensing
  @{ */
#define PIN_PCIE_FUNCTION_PIS_2_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PIS_2_INT_PIN 1U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PIS_2_INT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_0 (coord N3), PCIe1_Plug_in_sensing
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_PCIE_FUNCTION_PIS_1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PIN_PCIE_FUNCTION_PIS_1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define PIN_PCIE_FUNCTION_PIS_1_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PIS_1_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PIS_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_0 (coord N3), PCIe1_Plug_in_sensing
  @{ */
#define PIN_PCIE_FUNCTION_PIS_1_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PIN_PCIE_FUNCTION_PIS_1_INT_PIN 0U                   /*!<@brief PORT pin number */
#define PIN_PCIE_FUNCTION_PIS_1_INT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_PCIeFunctionPins(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_17 (coord N12), DebugLED_1
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_USRLED_DebugLED_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_USRLED_DebugLED_1_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define PIN_USRLED_DebugLED_1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define PIN_USRLED_DebugLED_1_PIN 17U                   /*!<@brief PORT pin number */
#define PIN_USRLED_DebugLED_1_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO2_19 (coord P12), DebugLED_2
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_USRLED_DebugLED_2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_USRLED_DebugLED_2_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define PIN_USRLED_DebugLED_2_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PIN_USRLED_DebugLED_2_PIN 19U                   /*!<@brief PORT pin number */
#define PIN_USRLED_DebugLED_2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO3_27 (coord P14), DebugLED_0
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_USRLED_DebugLED_0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_USRLED_DebugLED_0_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define PIN_USRLED_DebugLED_0_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_USRLED_DebugLED_0_PIN 27U                   /*!<@brief PORT pin number */
#define PIN_USRLED_DebugLED_0_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_LEDs(void); /* Function assigned for the Cortex-M4F */

#define PIO220_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO220_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */

/*! @name PIO2_20 (coord P13), PMBus
  @{ */
#define PIN_UARTPMBus_SCL_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PIN_UARTPMBus_SCL_PIN 20U                   /*!<@brief PORT pin number */
#define PIN_UARTPMBus_SCL_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_DEBUG_UARTPins(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_ANALOG_EN 0x00u     /*!<@brief Enables analog function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*!
 * @brief This is a de-initialization function for 'PIN_INIT_DEBUG_UARTPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void PIN_INIT_DEBUG_UARTPins_deinit(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_FUNC7 0x07u         /*!<@brief Selects pin function 7 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO4_8 (coord B14), U12[17]/JP11[1]/P4_8-ENET_TXD0
  @{ */
#define PIN_ENET_ENET_TXD0_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_TXD0_PIN 8U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_TXD0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_17 (coord E14), U12[18]/P0_17-ENET_TXD1
  @{ */
#define PIN_ENET_ENET_TXD1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_TXD1_PIN 17U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_TXD1_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                     /* @} */

