pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.h
/*! @name PIO4_13 (coord B6), U12[16]/P4_13-ENET_TX_EN
  @{ */
#define PIN_ENET_ENET_TX_EN_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_TX_EN_PIN 13U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_TX_EN_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO4_11 (coord A9), U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0
  @{ */
#define PIN_ENET_ENET_RXD0_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_RXD0_PIN 11U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_RXD0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO4_12 (coord A6), U12[7]/P4_12-ENET_RXD1
  @{ */
#define PIN_ENET_ENET_RXD1_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_RXD1_PIN 12U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_RXD1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO4_10 (coord B9), U12[11]/P4_10-ENET_CRS_DV
  @{ */
#define PIN_ENET_ENET_CRS_DV_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_CRS_DV_PIN 10U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_CRS_DV_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO4_16 (coord C4), U12[12]/P4_16-ENET_MDIO
  @{ */
#define PIN_ENET_ENET_MDIO_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_MDIO_PIN 16U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_MDIO_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO4_15 (coord A4), U12[13]/P4_15-ENET_MDC
  @{ */
#define PIN_ENET_ENET_MDC_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_MDC_PIN 15U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_MDC_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_26 (coord H11), U12[15]/P2_26-ENET_PHY_RSTn
  @{ */

/* Symbols to be used with GPIO driver */
#define PIN_ENET_ENET_PHY_RSTn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PIN_ENET_ENET_PHY_RSTn_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define PIN_ENET_ENET_PHY_RSTn_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_PHY_RSTn_PIN 26U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_PHY_RSTn_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO4_14 (coord B5), JS18[2]/P4_14-ENET_RX_CLK
  @{ */
#define PIN_ENET_ENET_RX_CLK_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define PIN_ENET_ENET_RX_CLK_PIN 14U                   /*!<@brief PORT pin number */
#define PIN_ENET_ENET_RX_CLK_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_ENETPins(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_ANALOG_EN 0x00u     /*!<@brief Enables analog function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*!
 * @brief This is a de-initialization function for 'PIN_INIT_ENETPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void PIN_INIT_ENETPins_deinit(void); /* Function assigned for the Cortex-M4F */

/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO013_FUNC_ALT1 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO013_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO014_FUNC_ALT1 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO014_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO122_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO122_FUNC_ALT1 0x01u
/*!
 * @brief Controls open-drain mode.: Normal. Normal push-pull output */
#define PIO122_OD_NORMAL 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast mode, slew rate control is disabled.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO122_SLEW_FAST 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO217_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 5. */
#define PIO217_FUNC_ALT5 0x05u
/*!
 * @brief Controls open-drain mode.: Normal. Normal push-pull output */
#define PIO217_OD_NORMAL 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast mode, slew rate control is disabled.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO217_SLEW_FAST 0x01u
/*!
 * @brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO321_ANAMODE_DISABLED 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO321_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Controls input glitch filter.: Filter enabled. Noise pulses below approximately 10 ns are filtered out. */
#define PIO321_FILTEROFF_ENABLED 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO321_FUNC_ALT1 0x01u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO321_MODE_INACTIVE 0x00u
/*!
 * @brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO322_ANAMODE_DISABLED 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO322_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Controls input glitch filter.: Filter enabled. Noise pulses below approximately 10 ns are filtered out. */
#define PIO322_FILTEROFF_ENABLED 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO322_FUNC_ALT1 0x01u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO322_MODE_INACTIVE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO323_FUNC_ALT1 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO323_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO324_FUNC_ALT1 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO324_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO42_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 2. */
#define PIO42_FUNC_ALT2 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast mode, slew rate control is disabled.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO42_SLEW_FAST 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO43_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 2. */
#define PIO43_FUNC_ALT2 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast mode, slew rate control is disabled.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO43_SLEW_FAST 0x01u

/*! @name PIO1_22 (coord P11), I2C_SUPP_SCL
  @{ */
#define PIN_I2C_SUPP_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_SUPP_SCL_PIN 22U                   /*!<@brief PORT pin number */
#define PIN_I2C_SUPP_SCL_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO2_17 (coord P10), I2C_SUPP_SDA
  @{ */
#define PIN_I2C_SUPP_SDA_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_SUPP_SDA_PIN 17U                   /*!<@brief PORT pin number */
#define PIN_I2C_SUPP_SDA_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_13 (coord F11), PCIe2_PowerMeasurement_I2C_SDA
  @{ */
#define PIN_I2C_SMB1_SDA_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_SMB1_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define PIN_I2C_SMB1_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_14 (coord E13), PCIe2_PowerMeasurement_I2C_SCL
  @{ */
#define PIN_I2C_SMB1_SCL_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_SMB1_SCL_PIN 14U                   /*!<@brief PORT pin number */
#define PIN_I2C_SMB1_SCL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO3_24 (coord E2), PCIe1_PowerMeasurement_I2C_SCL
  @{ */
#define PIN_I2C_SMB2_SCL_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_SMB2_SCL_PIN 24U                   /*!<@brief PORT pin number */
#define PIN_I2C_SMB2_SCL_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO3_23 (coord C2), PCIe1_PowerMeasurement_I2C_SDA
  @{ */
#define PIN_I2C_SMB2_SDA_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_SMB2_SDA_PIN 23U                   /*!<@brief PORT pin number */
#define PIN_I2C_SMB2_SDA_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO4_2 (coord F14), PCIe1_PowerMeasurement_I2C_SDA
  @{ */
#define PIN_I2C_PM1_SDA_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM1_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM1_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO4_3 (coord F13), PCIe1_PowerMeasurement_I2C_SCL
  @{ */
#define PIN_I2C_PM1_SCL_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM1_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM1_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO3_22 (coord N5), PCIe2_PowerMeasurement_I2C_SCL
  @{ */
#define PIN_I2C_PM2_SCL_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM2_SCL_PIN 22U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM2_SCL_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO3_21 (coord P5), PCIe2_PowerMeasurement_I2C_SDA
  @{ */
#define PIN_I2C_PM2_SDA_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM2_SDA_PIN 21U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM2_SDA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_I2Cpins(void); /* Function assigned for the Cortex-M4F */

