pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.h
#define IOCON_PIO_ANAMODE_DI 0x40u    /*!<@brief Disable analog Mode */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC3 0x03u         /*!<@brief Selects pin function 3 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO3_20 (coord N2), JTAG_CLK
  @{ */
#define PINS_JTAG_JTAG_TCK_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PINS_JTAG_JTAG_TCK_PIN 20U                   /*!<@brief PORT pin number */
#define PINS_JTAG_JTAG_TCK_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO2_13 (coord P7), PCIe1_JTAG_TDO
  @{ */

/* Symbols to be used with GPIO driver */
#define PINS_JTAG_JTAG_TDO_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PINS_JTAG_JTAG_TDO_1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define PINS_JTAG_JTAG_TDO_1_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PINS_JTAG_JTAG_TDO_1_PIN 13U                   /*!<@brief PORT pin number */
#define PINS_JTAG_JTAG_TDO_1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_1 (coord P4), JTAG_TMS
  @{ */

/* Symbols to be used with GPIO driver */
#define PINS_JTAG_JTAG_TMS_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PINS_JTAG_JTAG_TMS_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define PINS_JTAG_JTAG_TMS_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define PINS_JTAG_JTAG_TMS_PIN 1U                   /*!<@brief PORT pin number */
#define PINS_JTAG_JTAG_TMS_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO2_10 (coord P1), PCIe2_JTAG_TDO
  @{ */

/* Symbols to be used with GPIO driver */
#define PINS_JTAG_JTAG_TDO_2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PINS_JTAG_JTAG_TDO_2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define PINS_JTAG_JTAG_TDO_2_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PINS_JTAG_JTAG_TDO_2_PIN 10U                   /*!<@brief PORT pin number */
#define PINS_JTAG_JTAG_TDO_2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_0 (coord P3), PCIe2_JTAG_TDI
  @{ */

/* Symbols to be used with GPIO driver */
#define PINS_JTAG_JTAG_TDI_2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PINS_JTAG_JTAG_TDI_2_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define PINS_JTAG_JTAG_TDI_2_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define PINS_JTAG_JTAG_TDI_2_PIN 0U                   /*!<@brief PORT pin number */
#define PINS_JTAG_JTAG_TDI_2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_8 (coord P8), PCIe1_JTAG_TDI
  @{ */

/* Symbols to be used with GPIO driver */
#define PINS_JTAG_JTAG_TDI_1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PINS_JTAG_JTAG_TDI_1_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define PINS_JTAG_JTAG_TDI_1_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PINS_JTAG_JTAG_TDI_1_PIN 8U                   /*!<@brief PORT pin number */
#define PINS_JTAG_JTAG_TDI_1_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_PcieJTAGPins(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_ANALOG_EN 0x00u     /*!<@brief Enables analog function */
#define IOCON_PIO_ANAMODE_DI 0x40u    /*!<@brief Disable analog Mode */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*!
 * @brief This is a de-initialization function for 'PIN_INIT_PcieJTAGPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void PIN_INIT_PcieJTAGPins_deinit(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO2_2 (coord C3), J9[6]/LED3/P2_2-CT1MAT1-USR_LED3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_PIN_LED3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_PIN_LED3_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_PIN_LED3_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_PIN_LED3_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_PIN_LED3_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO3_3 (coord A13), J9[8]/LED2/P3_3-USR_LED2
  @{ */

