pmamatis/NAA-Measurment-Carrier-System/Code/C/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_PIN_LED2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_PIN_LED2_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_PIN_LED2_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_PIN_LED2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_PIN_LED2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO3_14 (coord E3), J13[5]/LED1/P3_14-CT3MAT1-USR_LED1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_PIN_LED1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_PIN_LED1_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_PIN_LED1_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_PIN_LED1_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_PIN_LED1_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_PIN_INIT_LED(void); /* Function assigned for the Cortex-M4F */

#define PIO218_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO218_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO220_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO220_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO2_20 (coord P13), PMBus
  @{ */
#define PIN_PMBUS_PMBus_SCL_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PMBUS_PMBus_SCL_PIN 20U                   /*!<@brief PORT pin number */
#define PIN_PMBUS_PMBus_SCL_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_18 (coord N10), PMBus
  @{ */
#define PIN_PMBUS_PMBus_SDA_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define PIN_PMBUS_PMBus_SDA_PIN 18U                   /*!<@brief PORT pin number */
#define PIN_PMBUS_PMBus_SDA_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_PMBUS(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_ANALOG_EN 0x00u     /*!<@brief Enables analog function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*!
 * @brief This is a de-initialization function for 'PIN_INIT_PMBUS' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void PIN_INIT_PMBUS_deinit(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INPFILT_OFF 0x0200u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_29 (coord B13), U24[13]/P0_29-ISP_FC0_RXD
  @{ */
#define BOARD_PIN_ISP_FC0_RXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_PIN_ISP_FC0_RXD_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_PIN_ISP_FC0_RXD_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_30 (coord A2), U24[12]/P0_30-ISP_FC0_TXD
  @{ */
#define BOARD_PIN_ISP_FC0_TXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_PIN_ISP_FC0_TXD_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_PIN_ISP_FC0_TXD_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_PIN_INIT_DEBUGConsole(void); /* Function assigned for the Cortex-M4F */

/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO013_FUNC_ALT1 0x01u
/*!
 * @brief
 * Controls the current sink capability of the pin.
 * : High drive.
 * Output drive sink is 20 mA.
 * This is needed for Fast Mode Plus I 2C.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO013_I2CDRIVE_HIGH 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO013_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO014_FUNC_ALT1 0x01u
/*!
 * @brief
 * Controls the current sink capability of the pin.
 * : High drive.
 * Output drive sink is 20 mA.
 * This is needed for Fast Mode Plus I 2C.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO014_I2CDRIVE_HIGH 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO014_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO323_FUNC_ALT1 0x01u
/*!
 * @brief
 * Controls the current sink capability of the pin.
 * : High drive.
 * Output drive sink is 20 mA.
 * This is needed for Fast Mode Plus I 2C.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO323_I2CDRIVE_HIGH 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO323_I2CSLEW_I2C_MODE 0x00u
/*!
 * @brief Input polarity.: Disabled. Input function is not inverted. */
#define PIO323_INVERT_DISABLED 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO324_FUNC_ALT1 0x01u
/*!
 * @brief
 * Controls the current sink capability of the pin.
 * : High drive.
 * Output drive sink is 20 mA.
 * This is needed for Fast Mode Plus I 2C.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO324_I2CDRIVE_HIGH 0x01u
/*!
 * @brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO324_I2CSLEW_I2C_MODE 0x00u

/*! @name PIO0_13 (coord F11), PCIe2_PowerMeasurement_I2C_SDA
  @{ */
#define PIN_I2C_PM2_SDA_HS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM2_SDA_HS_PIN 13U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM2_SDA_HS_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_14 (coord E13), PCIe2_PowerMeasurement_I2C_SCL
  @{ */
#define PIN_I2C_PM2_SCL_HS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM2_SCL_HS_PIN 14U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM2_SCL_HS_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_24 (coord E2), PCIe1_PowerMeasurement_I2C_SCL
  @{ */
#define PIN_I2C_PM1_SCL_HS_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM1_SCL_HS_PIN 24U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM1_SCL_HS_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_23 (coord C2), PCIe1_PowerMeasurement_I2C_SDA
  @{ */
#define PIN_I2C_PM1_SDA_HS_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define PIN_I2C_PM1_SDA_HS_PIN 23U                   /*!<@brief PORT pin number */
#define PIN_I2C_PM1_SDA_HS_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PIN_INIT_I2Cpins_HS(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
